{
  "projectName": "Project",
  "abstractions": [
    {
      "name": "Project",
      "description": "Imagine a Project as your entire manga series. It holds all the information about your story, including the scenario (plot, characters, etc.) and the visual layout (pages and panels). It's like a folder that contains all the files and assets for your manga, allowing you to manage and develop your story from beginning to end. The Project also has an `updatedAt` timestamp, which is useful for managing when it was last modified.",
      "files": [
        "App.tsx",
        "types.ts",
        "components/MangaBoard.tsx",
        "components/Checklist.tsx"
      ]
    },
    {
      "name": "ScenarioData",
      "description": "ScenarioData is like the script or outline for your manga chapter. It defines the story's key elements such as the title, theme, characters, plot, and dialogues. Think of it as the written foundation upon which you build the visual aspects of your manga. It includes properties for each step of the writing process, from character creation to cover description, guiding you through the story development workflow.",
      "files": [
        "App.tsx",
        "types.ts",
        "components/ScenarioWizard.tsx",
        "components/AiChat.tsx"
      ]
    },
    {
      "name": "Page",
      "description": "A Page is a single page in your manga. It contains multiple panels that make up the layout of the page. Think of it as a canvas that you divide into sections, each depicting a specific scene or action.  Each page is made up of panels, which define the visual storytelling on that page.",
      "files": [
        "types.ts",
        "components/MangaBoard.tsx"
      ]
    },
    {
      "name": "Panel",
      "description": "A Panel represents a single frame or section on a manga page. It contains a description (prompt) used to generate an image, and a collection of bubbles (dialogue or thoughts). Imagine it as a comic strip frame where the action happens, including the visual art and character's speech.",
      "files": [
        "types.ts",
        "components/MangaBoard.tsx"
      ]
    },
    {
      "name": "Bubble",
      "description": "A Bubble represents a speech or thought bubble within a panel. It contains the text spoken or thought by a character, and its type (speech, thought, etc.).  Think of it as a container for the text within a panel, complete with location and type info. These Bubbles let you determine placement, and type of text that should render. The AI determines actual text.",
      "files": [
        "types.ts",
        "components/MangaBoard.tsx"
      ]
    },
    {
      "name": "AiChat",
      "description": "AiChat is the component responsible for interacting with the AI (Gemini) to generate content. Think of it as a personal assistant that helps you brainstorm ideas, write descriptions, and refine your story. It's like a chat interface where you can ask questions and receive suggestions, powered by the AI model.",
      "files": [
        "components/AiChat.tsx"
      ]
    },
    {
      "name": "ViewState",
      "description": "ViewState is a simple state management system for the application's current screen or mode. Think of it as a navigator that determines which part of the application you're currently viewing and interacting with, such as the dashboard, scenario editor, or storyboard.",
      "files": [
        "App.tsx",
        "types.ts"
      ]
    },
    {
      "name": "GeminiService",
      "description": "GeminiService encapsulates all the calls to the Google Gemini API.  Think of it as a dedicated service that facilitates communication with the remote AI model, handling tasks such as generating images, creating chat sessions, and summarizing text.  It keeps calls to the AI organized and reusable.",
      "files": [
        "services/geminiService.ts",
        "components/AiChat.tsx",
        "components/MangaBoard.tsx"
      ]
    }
  ],
  "relationships": {
    "summary": "The code represents an AI-powered manga creation application. The application allows users to define a manga project's scenario, create storyboards, and potentially generate manga pages. The `App.tsx` file is the main component that manages the application's state and navigation between different views (dashboard, scenario, storyboard). It uses components like `ScenarioWizard`, `MangaBoard`, and `Checklist` to provide different functionalities. The `AiChat.tsx` component provides a chat interface to interact with the Gemini AI model to generate content based on the current scenario step.",
    "relationships": [
      {
        "from": "App",
        "to": "ScenarioWizard",
        "label": "renders"
      },
      {
        "from": "App",
        "to": "MangaBoard",
        "label": "renders"
      },
      {
        "from": "App",
        "to": "Checklist",
        "label": "renders"
      },
      {
        "from": "ScenarioWizard",
        "to": "ScenarioData",
        "label": "uses"
      },
      {
        "from": "MangaBoard",
        "to": "Project",
        "label": "uses"
      },
      {
        "from": "Project",
        "to": "ScenarioData",
        "label": "contains"
      },
      {
        "from": "Project",
        "to": "Page",
        "label": "contains"
      },
      {
        "from": "Page",
        "to": "Panel",
        "label": "contains"
      },
      {
        "from": "Panel",
        "to": "Bubble",
        "label": "contains"
      },
      {
        "from": "AiChat",
        "to": "GeminiService",
        "label": "uses"
      },
      {
        "from": "AiChat",
        "to": "ScenarioData",
        "label": "uses"
      }
    ]
  },
  "generatedAt": "2025-12-30T00:25:44.274Z"
}