{
  "projectName": "Project",
  "abstractions": [
    {
      "name": "Project Data Model",
      "description": "Like a master production binder for a manga series, this abstraction encapsulates the entire creative lifecycle. It holds the high-level narrative 'Scenario' (scripts, themes, characters) alongside the granular visual 'Pages' (panels, image prompts, and speech bubbles). By centralizing this state, the application ensures that AI-generated content in later stages, like storyboarding, remains contextually aware of the characters and plot points established in the initial writing phases.",
      "files": [
        "types.ts",
        "App.tsx"
      ]
    },
    {
      "name": "Gemini AI Service",
      "description": "Think of this as a tireless ghostwriter and storyboard assistant that lives in the cloud. It acts as the bridge between the user's raw ideas and structured creative output. It doesn't just process text; it understands the 'manga language'—translating a scene description into optimized image generation prompts, panel layouts, or dialogue suggestions. It uses specialized system instructions to maintain the tone and logic of a Japanese comic throughout the workflow.",
      "files": [
        "services/geminiService.ts"
      ]
    },
    {
      "name": "Scenario Pipeline",
      "description": "This is a creative GPS that guides a writer through 11 mandatory waypoints. Instead of staring at a blank page, the author is prompted to define specific elements like 'Universe,' 'Key Events,' and 'Dialogues' in a logical sequence. Each step builds upon the last, ensuring that by the time the user reaches the drawing board, they have a robust architectural blueprint for their story, preventing the common 'writer's block' found in open-ended tools.",
      "files": [
        "components/ScenarioWizard.tsx",
        "types.ts"
      ]
    },
    {
      "name": "Contextual AI Co-Pilot",
      "description": "An interactive whiteboard session with a professional editor who has perfect memory. Unlike a standard chatbot, this abstraction is injected with the specific context of the current project step. It knows if you are brainstorming characters or fine-tuning a climax. It allows for a collaborative 'ping-pong' of ideas where the user can ask for suggestions and instantly 'apply' the AI’s draft directly into their project editor with one click.",
      "files": [
        "components/AiChat.tsx"
      ]
    },
    {
      "name": "Visual Storyboard Engine",
      "description": "A digital light table where the script takes physical form. This abstraction manages the hierarchical relationship between a Page, its Panels, and the interactive Speech Bubbles layered on top. It handles the complex logic of 'Ink Mode' (B&W vs Color), panel-specific AI image generation, and the drag-and-drop positioning of dialogue, effectively turning a text-based script into a visual medium that can be exported as a PDF or individual images.",
      "files": [
        "components/MangaBoard.tsx",
        "types.ts"
      ]
    },
    {
      "name": "Mission Log Tracker",
      "description": "Like a 'Quest Log' in a role-playing game, this abstraction tracks the completion status of the creative journey. It monitors the state of the Project Model to determine which of the 11 scenario steps are finished. It provides the user with a visual progress bar and a navigation shortcut to missing sections, ensuring that the necessary creative 'ingredients' are gathered before the final generation of a full chapter.",
      "files": [
        "components/Checklist.tsx"
      ]
    }
  ],
  "relationships": {
    "summary": "MangaForge AI is a creative platform designed for mangakas to transform ideas into structured storyboards. It utilizes a central project data model to track story progress across a multi-step scenario pipeline. An integrated AI co-pilot, powered by the Gemini service, provides contextual brainstorming assistance at each stage of development. The system features a visual storyboard engine for panel layouts and a mission log tracker to manage completion status and project milestones.",
    "relationships": [
      {
        "from": "Project Data Model",
        "to": "Scenario Pipeline",
        "label": "defines state structure for"
      },
      {
        "from": "Scenario Pipeline",
        "to": "Project Data Model",
        "label": "updates story attributes and script data"
      },
      {
        "from": "Contextual AI Co-Pilot",
        "to": "Gemini AI Service",
        "label": "requests content generation and brainstorming from"
      },
      {
        "from": "Contextual AI Co-Pilot",
        "to": "Scenario Pipeline",
        "label": "provides step-specific creative suggestions within"
      },
      {
        "from": "Visual Storyboard Engine",
        "to": "Project Data Model",
        "label": "renders and edits page and panel data from"
      },
      {
        "from": "Mission Log Tracker",
        "to": "Project Data Model",
        "label": "monitors completion status of"
      },
      {
        "from": "Mission Log Tracker",
        "to": "Scenario Pipeline",
        "label": "facilitates navigation to specific steps in"
      },
      {
        "from": "Gemini AI Service",
        "to": "Project Data Model",
        "label": "receives historical project context from"
      }
    ]
  },
  "generatedAt": "2025-12-30T00:53:10.535Z"
}