{
  "projectName": "Project",
  "abstractions": [
    {
      "name": "A2UI Protocol",
      "description": "The central language of the project, defining how agents describe user interfaces using structured JSON. Think of it as a restaurant menu: the agent (waiter) uses it to tell the client (kitchen) exactly what the user (diner) should be served. This format ensures that even though the UI is generated by an AI, it remains safe data rather than executable code, preventing security risks while maintaining high expressivity across different platforms.",
      "files": [
        "specification/0.9/docs/a2ui_protocol.md",
        "specification/0.9/json/server_to_client.json",
        "docs/concepts/overview.md"
      ]
    },
    {
      "name": "Component Catalog",
      "description": "A registry of approved UI building blocks like buttons, text fields, and cards. It acts as a set of LEGO bricks that the client already knows how to build; the agent can only request components that exist in this catalog. This 'allow-list' approach ensures the UI remains consistent with the host application's design system and prevents the agent from attempting to render untrusted or broken elements.",
      "files": [
        "specification/0.9/json/standard_catalog_definition.json",
        "renderers/lit/src/0.8/ui/component-registry.ts",
        "renderers/angular/src/lib/rendering/catalog.ts"
      ]
    },
    {
      "name": "Surface and Surface Updates",
      "description": "The mechanism for managing the visual state of the UI over time. A 'Surface' is a persistent canvas that the agent can modify. Instead of redrawing the entire screen for every turn of the conversation, the agent sends 'Surface Updates' to add, remove, or modify specific components by their IDs. It is like a whiteboard where the agent can erase and redraw small sections without wiping the whole board clean.",
      "files": [
        "docs/concepts/data-flow.md",
        "specification/0.9/json/server_to_client.json",
        "renderers/lit/src/0.8/data/model-processor.ts"
      ]
    },
    {
      "name": "Renderer",
      "description": "The framework-specific engine (e.g., Angular or Lit) that translates abstract JSON descriptions into actual interactive pixels. It acts as a universal translator, taking the 'intent' sent by the agent and converting it into the specific technical 'dialect' required by the browser. This allows the same UI description from an agent to look and behave correctly whether it is rendered in a web app, a mobile app, or a desktop environment.",
      "files": [
        "renderers/angular/src/lib/rendering/renderer.ts",
        "renderers/lit/src/0.8/ui/ui.ts",
        "docs/guides/renderer-development.md"
      ]
    },
    {
      "name": "Data Binding and Signals",
      "description": "The system that connects UI components to underlying data values. If an agent updates a price in its data model, the 'Signal' automatically pushes that change to every component displaying that price. It works like puppet strings: by pulling on a single data value, all connected UI elements move in sync, ensuring the user interface always reflects the most current information without manual refreshes.",
      "files": [
        "docs/concepts/data-binding.md",
        "renderers/lit/src/0.8/data/signal-model-processor.ts",
        "renderers/angular/src/lib/data/processor.ts"
      ]
    },
    {
      "name": "Agent Extensions",
      "description": "Server-side libraries (available in Python and Java) that provide a programmatic way for developers to build A2UI messages. Rather than forcing the AI to manually construct complex JSON strings, these extensions offer a structured API to define components and layouts. They act like a specialized scribe, helping the agent draft its UI responses accurately and according to the protocol's strict rules.",
      "files": [
        "a2a_agents/python/a2ui_extension/src/a2ui/a2ui_extension.py",
        "a2a_agents/java/src/main/java/org/a2ui/A2uiExtension.java",
        "docs/guides/agent-development.md"
      ]
    },
    {
      "name": "Client-to-Server Events",
      "description": "The feedback loop that allows user interactions to be sent back to the agent. When a user clicks a button or submits a form, the client generates an event message containing the input data. This is like a walkie-talkie: it provides the necessary return channel so the agent can understand how the user is interacting with the generated UI and decide how to update the interface in response.",
      "files": [
        "specification/0.9/json/client_to_server.json",
        "renderers/lit/src/0.8/events/events.ts",
        "docs/reference/messages.md"
      ]
    }
  ],
  "relationships": {
    "summary": "The A2UI (Agent-to-User Interface) project is a framework and communication protocol designed to enable AI agents to deliver rich, interactive UI components to clients. It consists of a multi-language agent-side extension (Java/Python) for generating protocol-compliant messages, and client-side renderers (Angular/Lit) that interpret these messages using a standardized component catalog. The system facilitates a reactive data flow through signals and data binding, allowing the agent to update specific 'surfaces' in the UI and receive structured events back from user interactions.",
    "relationships": [
      {
        "from": "Agent Extensions",
        "to": "A2UI Protocol",
        "label": "implements and generates messages for"
      },
      {
        "from": "A2UI Protocol",
        "to": "Renderer",
        "label": "defines the schema interpreted by"
      },
      {
        "from": "Renderer",
        "to": "Component Catalog",
        "label": "uses to look up and instantiate UI elements"
      },
      {
        "from": "Component Catalog",
        "to": "Surface and Surface Updates",
        "label": "provides the building blocks for"
      },
      {
        "from": "Data Binding and Signals",
        "to": "Surface and Surface Updates",
        "label": "enables reactive state updates within"
      },
      {
        "from": "Surface and Surface Updates",
        "to": "Client-to-Server Events",
        "label": "captures user interactions as"
      },
      {
        "from": "Client-to-Server Events",
        "to": "Agent Extensions",
        "label": "sends user feedback back to the"
      },
      {
        "from": "Renderer",
        "to": "Data Binding and Signals",
        "label": "manages and synchronizes"
      },
      {
        "from": "Agent Extensions",
        "to": "Surface and Surface Updates",
        "label": "specifies the layout and content of"
      }
    ]
  },
  "generatedAt": "2025-12-30T15:25:39.023Z"
}